Revit 2026 API

# PipingSystemGetVolume Method

---

Gets the volume of this piping system.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetVolume()
```
```vb
Public Function GetVolume As Double
```
```cpp
public:
double GetVolume()
```
```fsharp
member GetVolume : unit -> float
```

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The volume can not be calculated for this system. |

The publicly exposed method.

#### Reference

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace